app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"  WHERE (address like '%{query}%')  ORDER BY rent
SELECT "rooms".* FROM "rooms"
---
  def index
	# import the @universities entries
	#@universities = University.all
	#set the search functionality

	if params[:search]
		@rooms = Room.search(params[:search]).order("rent")
	else
		@rooms = Room.all

INSERT INTO "rooms" ("address", "apt_gender", "created_at", "desc", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", ""], ["apt_gender", ""], ["created_at", "2014-05-30 17:06:17.879244"], ["desc", ""], ["updated_at", "2014-05-30 17:06:17.879244"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "desc" = ?, "updated_at" = ? WHERE "rooms"."id" = 2  [["desc", "Dormitory of Santa Clara University Student. Great People live in Great School!"], ["updated_at", "2014-05-30 04:15:08.154716"]]
---
  def update
    respond_to do |format|
      if @room.update(room_params)